#include <iostream>
#include <fstream>

using namespace std;

int main(void)
{
    setlocale(LC_ALL, "rus");
    cout << "Умова:\n2x - 4y + 9z = 28\n7x + 3y - 6z = -1\n7x + 9y - 9z = 5\n";
    int a11 = 2, a12 = -4, a13 = 9, a14 = 28, a21 = 7, a22 = 3, a23= -6, a24 = -1, a31 =7, a32 = 9, a33 = -9, a34 = 5;
    int x, y, z;
    cout << "Матричний вигляд:\n" << a11 << "\t" << a12 << "\t" << a13 << "\t" << a14 << "\n" << a21 << "\t" << a22 << "\t" << a23 << "\t" << a24 << "\n" << a31 << "\t" << a32 << "\t" << a33 << "\t" << a34 << "\n";
    cout << "Перемножимо 1 рядок на 7 та вiднiмемо 2 рядок, помножений на 2; вiднiмемо 3 рядок вiд 2-го:\n";
    cout <<  7*a11 - 2*a21 << "\t" << 7*a12 - 2*a22 << "\t" << 7*a13 - 2*a23 << "\t" << 7*a14 - 2*a24 << "\n" << a21- a31 << "\t" << a22 - a32 << "\t" << a23 - a33 << "\t" << a24 - a34 << "\n" << a31 << "\t" << a32 << "\t" << a33 << "\t" << a34 << "\n";
    cout << "Перемножимо 1 рядок на 6 та вiднiмемо 2 рядок, помножений на 34:\n";
    cout << 6*(7 * a11 - 2 * a21) - 34*(a21 - a31) << "\t" << 6*(7 * a12 - 2 * a22) - 34 * (a22 - a32) << "\t" << 6*(7 * a13 - 2 * a23) - 34 * (a23 - a33) << "\t" << 6*(7 * a14 - 2 * a24) - 34 * (a24 - a34) << "\n" << a21 - a31 << "\t" << a22 - a32 << "\t" << a23 - a33 << "\t" << a24 - a34 << "\n" << a31 << "\t" << a32 << "\t" << a33 << "\t" << a34 << "\n";
    z = (6 * (7 * a14 - 2 * a24) - 34 * (a24 - a34)) / (6 * (7 * a13 - 2 * a23) - 34 * (a23 - a33));
    cout << "Отже:\nz = 1392 / 348 = "<< z << endl;
    y = ((a24 - a34) - z * (a23 - a33)) / (a22 - a32);
    cout << "y = (-6 - 3 * 4) / -6 = -18 / -6 = " << y << endl;
    x = (a34 - a32 * y - a33 * z) / a31;
    cout << "x = (5 - 9 * 3 - (-9) *4) /7 = 14 /7 = " << x << endl;
    cout << "Перевiрка:\n2x - 4y + 9z = " << 2*x - 4*y + 9*z << "\n7x + 3y - 6z = " << 7*x + 3*y - 6*z << "\n7x + 9y - 9z = " << 7*x + 9*y - 9*z;
    cout << "\nВiдповiдь:\nx = " << x << "\ny = " << y << "\nz = " << z;
    string path;
    cout << "\n\nВведiть назву файлу для запису даних: " << endl;
    cin >> path;
    ofstream f;
    f.open(path);
    f << "x = " << x << "\ny = " << y << "\nz = " << z;
    f.close();
    return 0;
}